// ==UserScript==
// @name YaKlass
// @namespace _FHZ SPASE
// @match *://*.yaklass.ru/p/osnovy-finansovoj-gramotnosti/10-11-klass/*/*/*
// @grant none
// @run-at document-end
// ==/UserScript==
// VARIABLES
yaklassanswer = $.parseJSON(`
{
	"10-11-klass":[
		{
			"name":"Классификация налогов и сборов",
			"type":"linear",
      "element":"select",
			"data":[
				"ФЕДЕРАЛЬНЫЕ НАЛОГИ И СБОРЫ",
				"РЕГИОНАЛЬНЫЕ НАЛОГИ И СБОРЫ",
				"МЕСТНЫЕ НАЛОГИ",
				"ОТРАСЛЕВЫЕ НАЛОГОВЫЕ СБОРЫ И ПЛАТЕЖИ",
				"СПЕЦИАЛЬНЫЕ НАЛОГОВЫЕ РЕЖИМЫ"
			]
		},
		{
			"name":"Для юридических лиц",
      "element":"input",
			"type":"qna",
			"data":[
				{
					"id":1,
					"question":"федерального характера",
					"answers":[
						"налог на добавленную стоимость",
						"страховые взносы во внебюджетные фонды"
					]
				},
				{
					"id":2,
					"question":"на региональном уровне ",
					"answers":[
						"налог на игорный бизнес",
						"налог на имущественные объекты компании",
						"налог на транспорт"
					]
				},
				{
					"id":3,
					"question":"на местном уровне",
					"answers":[
						"налог на землю"
					]
				}
			]
		}
	]
}
`);
theme = '';
$(function(){
  window.theme = $.trim($('#itemtitle').html());
//DISPLAY
  $('<div>',{class:'ykresheba'}).appendTo('body').css({
    background: 'rgba(255, 255, 255, 0.83)',
    position: 'fixed',
    top: '100px',
    right: '50px',
    padding: '10px 25px',
    border: '1px solid #000'
  }).html('<a>Question: '+window.theme+'</a><br/><a>Made by Fleisar</a>');
  $('<button>',{class:'warning'}).appendTo('body').css({
    background: 'repeating-linear-gradient(-45deg, rgba(183, 39, 39, 0.83), rgba(183, 39, 39, 0.83) 25px, rgba(234, 55, 55, 0.83) 25px, rgba(234, 55, 55, 0.83) 50px) fixed',
    position: 'fixed',
    bottom: '0',
    left: '0',
    width: '100%',
    zIndex: '99',
    border: 'none',
    padding: '10px',
    color: '#fff'
  }).html('Использование данного скрипта вредит вашему мозгу, т.к. вы не думаете. Скрипт предназначен лишь для ознакомления и демонстрации уязвимости генератора Genexis. ( ͡° ͜ʖ ͡°)');
});
console.log(yaklassanswer);
// JSON READER
if($('input[type="text"]').size() != 0){
  switch($('.gxs-text').html()){
    case 'Событие, подлежащее страхованию гражданской ответственности, в частности юридических лиц, должно обладать признаками':
      var listof = [
        'вероятности и случайности'
      ];
      break;
      case 'Вступление в силу решения суда о признании страхователя виновным и обязанным возместить понесённый заказчиком ущерб, в том числе и моральный, по договору страхования гражданской ответственности является':
      var listof = [
        'страховым риском'
      ];
      break;
      case 'Обязательному страхованию гражданской ответственности подлежат':
      var listof = [
        'страховым риском'
      ];
      break;
  }
  $('input').val(listof);
}
if($('input:not([type="text"])').size() != 0){
switch($('.gxs-text').html()){
  case 'федерального характера':
    var listof = [
      'налог на добавленную стоимость',
      'страховые взносы во внебюджетные фонды',
      'налог на доход физического лица (за своих работников)',
      'налог на воду',
      'сборы за пользование объектами водных биологических ресурсов.',
      'государственные пошлины.'
    ];
   break;
  case 'на региональном уровне ':
    var listof = [
      'налог на игорный бизнес',
      'налог на имущественные объекты компании',
      'налог на транспорт'
    ];
  break;
  case 'на местном уровне':
    var listof = [
      'налог на землю',
      'налог на землю'
    ];
  break;
  case 'Индивидуальные предприниматели обязаны исчислять и производить выплаты по следующим налоговым платежам:':
          var listof = [
            'НДФЛ, если ИП имеет прибыль, получение которой не связано с ведением бизнеса.',
            'НДФЛ за своих работников.'
          ];
        break;
        case 'ИП должен перечислять:':
          var listof = [
            'ЕСХН',
            'ЕНВД',
            'НДФЛ за своих работников. ',
            'единый налог на вмененный доход.',
            'налог при ведении бизнеса в игровой сфере.',
            'НДС'
          ];
        break;
        case 'Предприниматели (как физические лица) обязаны производить оплату следующих налоговых сборов: ':
          var listof = [
            'НДФЛ, если ИП имеет прибыль, получение которой не связано с ведением бизнеса. ',
            'платежи по водному налогу'
          ];
        break;
        case 'Предприниматели (как физические лица) обязаны производить оплату таких налоговых сборов: ':
          var listof = [
            'налог на транспорт',
            'земельный налог'
          ];
        break;
        case 'Предпринимателю нужно также исчислять: ':
          var listof = [
            'налоги в рамках патентной системы налогообложения.',
            'налоги в рамках упрощенной системы налогообложения.',
            'верны оба варианта.'
          ];
        break;
        case 'Индивидуальные предприниматели обязаны исчислять и производить выплаты по следующим налоговым платежам:':
          var listof = [
            'НДФЛ, если ИП имеет прибыль, получение которой не связано с ведением бизнеса.',
            'НДФЛ за своих работников.'
          ];
        break;
        case 'Предприниматели (как физические лица) обязаны производить оплату таких налоговых сборов:':
          var listof = [
            'налог на транспорт. ',
            'земельный налог. '
          ];
        break;
    case 'В каких случаях граждане должны уплачивать налог на доходы физических лиц?':
          var listof = [
            'получение доходов от занятия преподавательской деятельностью'
          ];
        break;
        case 'Какие из приведенных ниже налоговых платежей и сборов могут ещё уплачивать граждане на территории РФ?':
          var listof = [
            'государственная пошлина'
          ];
        break;
        case 'Что не относится к имущественным налогам, уплачиваемым гражданами:':
          var listof = [
            'налог на имущество организации',
            ' налог на имущественные объекты, которые получены наследниками или приняты в дар.'
          ];
        break;
        case 'Какие из приведенных ниже налоговых платежей и сборов могут уплачивать граждане на территории РФ?':
          var listof = [
            'нет верного ответа',
            'пошлина при регистрации акта гражданского состояния'
          ];
        break;
        case 'Что относится к имущественным налогам, уплачиваемым гражданами:':
          var listof = [
            'земельный налог',
            'транспортный налог'
          ];
        break;
        case 'Налог на доходы физических лиц исчисляется в:':
          var listof = [
            'процентах'
          ];
        break;
    case 'Индивидуальные предприниматели, перешедшие на ЕНВД':
          var listof = [
            'не уплачивают НДФЛ со своих доходов, уплачивая при этом НДФЛ с доходов своих работников'
          ];
        break;
    case 'При внедоговорной (деликтной) ответственности ущерб или вред:':
          var listof = [
            'возмещается лицам, не связанным с причинителем вреда никакими договорными обязательствами'
          ];
        break;
    case 'При страховании гражданской ответственности предприятий — источников повышенной опасности выгодоприобретателями будут являться:':
          var listof = [
            'Третьи лица, которым причинён вред, являющийся страховым случаем',
            'Физические лица, которым причинён вред, являющийся страховым случаем',
            'Юридические лица, которым причинён вред, являющийся страховым случаем'
          ];
        break;
    case 'Для возникновения гражданской ответственности по возмещению ущерба за вред, нанесённый третьим лицам, необходимы следующие факторы:':
          var listof = [
            'Наличие прямых отношений между страхователем и пострадавшим',
            'Противоправное поведение страхователя',
            'Наличие вины страхователя'
          ];
        break;
    case 'Страхование гражданской ответственности предполагает:':
          var listof = [
            'Возмещение финансового вреда',
            'Возмещение материального вреда',
            'Компенсацию морального ущерба'
          ];
        break;
    case 'При рассмотрении дела о необходимости компенсации причинённого ущерба обязанность доказать отсутствие вины страхователя лежит на:':
          var listof = [
            'Самом страхователе'
          ];
        break;
    case 'К действиям, освобождающим страхователя от необходимости произвести компенсацию причинённого третьему лицу вреда, в частности относится:':
          var listof = [
            'Крайняя необходимость'
          ];
        break;
    case 'На основании представленных сведений при вынесении решения по делу о возмещении причинённого вреда суд НЕ вправе:':
          var listof = [
            'Полностью освободить виновную сторону от необходимости возместить причинённый ущерб'
          ];
        break;
    case 'Любое неблагоприятное обстоятельство, влияющее на человека или случившееся с ним, например, любое умаление (уменьшение) личного или имущественного блага, охраняемого правом — это:':
          var listof = [
            'Вред'
          ];
        break;
    case 'Расходы, которые лицо, чьё право нарушено, произвело или должно будет произвести для восстановления своего нарушенного права (восстановить статус-кво) — это:':
          var listof = [
            'Реальный ущерб'
          ];
        break;
    case 'При рассмотренни дела о необходимости компенсации причинённого ущерба суд руководствуется принципом:':
          var listof = [
            'Презумпции вины'
          ];
        break;
}
console.log(listof);
fieldinput(listof);
}
if($('select').size() !== 0){
  var event = $.trim($('#itemtitle').html());
switch(event) {
    case 'Классификация налогов и сборов':
    var listof = [
      'ФЕДЕРАЛЬНЫЕ НАЛОГИ И СБОРЫ',
      'РЕГИОНАЛЬНЫЕ НАЛОГИ И СБОРЫ',
      'МЕСТНЫЕ НАЛОГИ',
      'ОТРАСЛЕВЫЕ НАЛОГОВЫЕ СБОРЫ И ПЛАТЕЖИ',
      'СПЕЦИАЛЬНЫЕ НАЛОГОВЫЕ РЕЖИМЫ'
    ];
    for (var f = 0; f < 6; f++) {
      var text = listof[f];
      for (var i = 1; i < 5; i++) {
          if ($('select:eq('+f+')>option:eq('+i+')').html() == text) {
            $('select:eq('+f+')>option:eq('+i+')').attr('selected','');
          }
      }
    } 
    break;
    default:
      switch($('.gxs-text').html()){
        case 'Сбор установлен в:': 
          var text = 'все варианты верны.'; 
        break;
        case 'Государственная пошлина - это:': 
          var text = 'сбор'; 
        break;
        case 'Сходство государственной пошлины с налогами заключается в:': 
          var text = 'все ответы верны.'; 
        break;
          case 'осударственная пошлина взымается с:': 
          var text = 'физических и юридических лиц при их обращении за совершением юридически значимых действий.'; 
        break;
          case 'Рассрочка или отсрочка предоставляется на срок до:': 
          var text = 'года.'; 
        break;
          case 'Являясь федеральным сбором, государственная пошлина:': 
          var text = 'обязательна к уплате на всей территории России.'; 
        break;
          case 'Государственная пошлина взымается с:': 
          var text = 'физических и юридических лиц при их обращении за совершением юридически значимых действий.'; 
        break;
          case 'Государственная пошлина РФ не взимается:': 
          var text = 'При погашении кредита в банке.'; 
        break;
          case 'При страховании гражданской ответственности круг застрахованных лиц': 
          var text = 'является неопределённым'; 
        break;
          case 'Причинение вреда третьему лицу в рамках договора страхования гражданской ответственности возможно': 
          var text = 'как в форме действия, так и в форме бездействия'; 
        break;
          case 'Компенсационный характер возмещения вреда по договору страхования гражданской ответственности означает': 
          var text = 'необходимость нанесшего вред лица возместить понесённые пострадавшим убытки в полном объёме'; 
        break;
          case 'Одной из отличительных черт страхования гражданской ответственности является': 
          var text = 'конкретное денежное выражение нанесённого третьему лицу ущерба'; 
        break;
          case 'Страховая сумма по договору страхования гражданской ответственности': 
          var text = 'может предполагать установление сублимитов ответственности'; 
        break;
      }
      console.log(text);
      for (var i = 1; i < 5; i++) {
          if ($('select>option:eq('+i+')').html() == text) {
            $('select>option:eq('+i+')').attr('selected','');
          }
      }
    break;
  }
}
function fieldinput(listof){
  for (var f = 1; f < $('input').size(); f++) {
      for (var i = 0; i < listof.length; i++) {
        var text = listof[i];
        if(typeof($('input:eq('+f+')+label>span:eq(1)>span').html()) == 'undefined'){
          var cbox = $('input:eq('+f+')+label>span:eq(1)').html();
        }else{
          var cbox = $('input:eq('+f+')+label>span:eq(1)>span').html();
        }
        console.log(cbox);
        if (cbox == text) {
          $('input:eq('+f+')').attr('checked','');
          console.log(cbox+' == '+text);
        }
      }
    }
}

